app/Models/CarroModel.php

    public function getCarros(){
        return $this->findAll();
---
SELECT *
FROM `tb_Carros`

    public function getCarro($id){
        return $this->asArray()->where(['id'=>$id])->first();
---
SELECT *
FROM `tb_Carros`
WHERE `id` = '8'
 LIMIT 1