app/Models/PessoasModel.php

SELECT *
FROM `tb_Pessoas`
---
    public function getPessoas(){
        return $this->findAll();

SELECT *
FROM `tb_Pessoas`
WHERE `id` = '9'
 LIMIT 1
---
    public function getPessoa($id){
        return $this->asArray()->where(['id'=>$id])->first();