app/Models/UsuarioModel.php

SELECT *
FROM `tb_usuarios`
---
    public function getUsuarios(){
        return $this->findAll();